{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(7,7)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(3,3)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_1", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu_1_min", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu_1_max", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu_1_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_pool_1", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[12, 0, 0], [12, 1, 0], [12, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2_red_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_red_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_red_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_red_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_red_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_red_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_2_red", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [13, 1, 0], [13, 2, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_2_red", 
      "inputs": [[20, 0, 0], [20, 1, 0], [20, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_2_red_dequantize", 
      "inputs": [[21, 0, 0], [21, 1, 0], [21, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2_red_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_red_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_red_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_red_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2_red", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2_red", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu_2_red_min", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu_2_red_max", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu_2_red_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [31, 1, 0], [31, 2, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_2", 
      "inputs": [[38, 0, 0], [38, 1, 0], [38, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_2_dequantize", 
      "inputs": [[39, 0, 0], [39, 1, 0], [39, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu_2_min", 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu_2_max", 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu_2_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_pool_2", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[49, 0, 0], [49, 1, 0], [49, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3a_1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [50, 1, 0], [50, 2, 0], [53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3a_1x1", 
      "inputs": [[57, 0, 0], [57, 1, 0], [57, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3a_1x1_dequantize", 
      "inputs": [[58, 0, 0], [58, 1, 0], [58, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_1x1", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3a_3x3_reduce", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[50, 0, 0], [66, 0, 0], [67, 0, 0], [50, 1, 0], [50, 2, 0], [68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3a_3x3_reduce", 
      "inputs": [[72, 0, 0], [72, 1, 0], [72, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3a_3x3_reduce_dequantize", 
      "inputs": [[73, 0, 0], [73, 1, 0], [73, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_3x3_reduce", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_3x3_reduce", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu_3a_3x3_reduce_min", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu_3a_3x3_reduce_max", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu_3a_3x3_reduce_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3a_3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0], [83, 1, 0], [83, 2, 0], [86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3a_3x3", 
      "inputs": [[90, 0, 0], [90, 1, 0], [90, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3a_3x3_dequantize", 
      "inputs": [[91, 0, 0], [91, 1, 0], [91, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_3x3", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3a_double_3x3_reduce", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[50, 0, 0], [99, 0, 0], [100, 0, 0], [50, 1, 0], [50, 2, 0], [101, 0, 0], [102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3a_double_3x3_reduce", 
      "inputs": [[105, 0, 0], [105, 1, 0], [105, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3a_double_3x3_reduce_dequantize", 
      "inputs": [[106, 0, 0], [106, 1, 0], [106, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_double_3x3_reduce", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0], [109, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_double_3x3_reduce", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu_3a_double_3x3_reduce_min", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu_3a_double_3x3_reduce_max", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu_3a_double_3x3_reduce_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3a_double_3x3_0", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [116, 1, 0], [116, 2, 0], [119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3a_double_3x3_0", 
      "inputs": [[123, 0, 0], [123, 1, 0], [123, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3a_double_3x3_0_dequantize", 
      "inputs": [[124, 0, 0], [124, 1, 0], [124, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_double_3x3_0", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_double_3x3_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu_3a_double_3x3_0_min", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu_3a_double_3x3_0_max", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu_3a_double_3x3_0_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3a_double_3x3_1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0], [136, 0, 0], [134, 1, 0], [134, 2, 0], [137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3a_double_3x3_1", 
      "inputs": [[141, 0, 0], [141, 1, 0], [141, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3a_double_3x3_1_dequantize", 
      "inputs": [[142, 0, 0], [142, 1, 0], [142, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_double_3x3_1", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_double_3x3_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_avg_pool_3a_pool", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(1,1)"
      }, 
      "inputs": [[50, 0, 0], [50, 1, 0], [50, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_proj_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_proj_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_proj_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_proj_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_proj_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_proj_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3a_proj", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0], [150, 1, 0], [150, 2, 0], [153, 0, 0], [154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3a_proj", 
      "inputs": [[157, 0, 0], [157, 1, 0], [157, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3a_proj_dequantize", 
      "inputs": [[158, 0, 0], [158, 1, 0], [158, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_proj_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_proj_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_proj_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_proj_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_proj", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0], [162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_proj", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_3a_chconcat", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[65, 0, 0], [98, 0, 0], [149, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "ch_concat_3a_chconcat_min", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "ch_concat_3a_chconcat_max", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "ch_concat_3a_chconcat_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[166, 0, 0], [167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_1x1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_1x1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_1x1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_1x1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_1x1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_1x1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3b_1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0], [169, 1, 0], [169, 2, 0], [172, 0, 0], [173, 0, 0], [174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3b_1x1", 
      "inputs": [[176, 0, 0], [176, 1, 0], [176, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3b_1x1_dequantize", 
      "inputs": [[177, 0, 0], [177, 1, 0], [177, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_1x1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_1x1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_1x1", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0], [181, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_reduce_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_reduce_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_reduce_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_reduce_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_reduce_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_reduce_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3b_3x3_reduce", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[169, 0, 0], [185, 0, 0], [186, 0, 0], [169, 1, 0], [169, 2, 0], [187, 0, 0], [188, 0, 0], [189, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3b_3x3_reduce", 
      "inputs": [[191, 0, 0], [191, 1, 0], [191, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3b_3x3_reduce_dequantize", 
      "inputs": [[192, 0, 0], [192, 1, 0], [192, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_reduce_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_reduce_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_3x3_reduce", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[193, 0, 0], [194, 0, 0], [195, 0, 0], [196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_3x3_reduce", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu_3b_3x3_reduce_min", 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu_3b_3x3_reduce_max", 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu_3b_3x3_reduce_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[199, 0, 0], [200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_3x3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3b_3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[202, 0, 0], [203, 0, 0], [204, 0, 0], [202, 1, 0], [202, 2, 0], [205, 0, 0], [206, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3b_3x3", 
      "inputs": [[209, 0, 0], [209, 1, 0], [209, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3b_3x3_dequantize", 
      "inputs": [[210, 0, 0], [210, 1, 0], [210, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_3x3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_3x3", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[211, 0, 0], [212, 0, 0], [213, 0, 0], [214, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_reduce_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_reduce_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_reduce_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_reduce_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_reduce_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_reduce_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3b_double_3x3_reduce", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[169, 0, 0], [218, 0, 0], [219, 0, 0], [169, 1, 0], [169, 2, 0], [220, 0, 0], [221, 0, 0], [222, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3b_double_3x3_reduce", 
      "inputs": [[224, 0, 0], [224, 1, 0], [224, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3b_double_3x3_reduce_dequantize", 
      "inputs": [[225, 0, 0], [225, 1, 0], [225, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_reduce_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_reduce_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_double_3x3_reduce", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[226, 0, 0], [227, 0, 0], [228, 0, 0], [229, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_double_3x3_reduce", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu_3b_double_3x3_reduce_min", 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu_3b_double_3x3_reduce_max", 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu_3b_double_3x3_reduce_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[232, 0, 0], [233, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_0_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_0_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_0_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_0_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_0_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_0_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3b_double_3x3_0", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[235, 0, 0], [236, 0, 0], [237, 0, 0], [235, 1, 0], [235, 2, 0], [238, 0, 0], [239, 0, 0], [240, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3b_double_3x3_0", 
      "inputs": [[242, 0, 0], [242, 1, 0], [242, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3b_double_3x3_0_dequantize", 
      "inputs": [[243, 0, 0], [243, 1, 0], [243, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_double_3x3_0", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[244, 0, 0], [245, 0, 0], [246, 0, 0], [247, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_double_3x3_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[249, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu_3b_double_3x3_0_min", 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu_3b_double_3x3_0_max", 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu_3b_double_3x3_0_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[250, 0, 0], [251, 0, 0], [252, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_double_3x3_1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3b_double_3x3_1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[253, 0, 0], [254, 0, 0], [255, 0, 0], [253, 1, 0], [253, 2, 0], [256, 0, 0], [257, 0, 0], [258, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3b_double_3x3_1", 
      "inputs": [[260, 0, 0], [260, 1, 0], [260, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3b_double_3x3_1_dequantize", 
      "inputs": [[261, 0, 0], [261, 1, 0], [261, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_double_3x3_1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3b_double_3x3_1", 
      "attrs": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[262, 0, 0], [263, 0, 0], [264, 0, 0], [265, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3b_double_3x3_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[267, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_avg_pool_3b_pool", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(1,1)"
      }, 
      "inputs": [[169, 0, 0], [169, 1, 0], [169, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3b_proj_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_proj_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_proj_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_proj_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_proj_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3b_proj_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_conv_3b_proj", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[269, 0, 0], [270, 0, 0], [271, 0, 0], [269, 1, 0], [269, 2, 0], [272, 0, 0], [273, 0, 0], [274, 0, 0], [275, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_conv_3b_proj", 
      "inputs": [[276, 0, 0], [276, 1, 0], [276, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "conv_3b_proj_dequantize", 
      "inputs": [[277, 0, 0], [277, 1, 0], [277, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3b_proj_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_proj_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_proj_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3b_proj_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
