{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_data", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(7,7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(3,3)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn0", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "relu0_min", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "relu0_max", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "relu0_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_pooling0", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[16, 0, 0], [16, 1, 0], [16, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "pooling0_dequantize", 
      "inputs": [[17, 0, 0], [17, 1, 0], [17, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage1_unit1_relu1_min", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage1_unit1_relu1_max", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage1_unit1_relu1_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit1_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [27, 1, 0], [27, 2, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit1_conv1", 
      "inputs": [[31, 0, 0], [31, 1, 0], [31, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit1_conv1_dequantize", 
      "inputs": [[32, 0, 0], [32, 1, 0], [32, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage1_unit1_relu2_min", 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage1_unit1_relu2_max", 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage1_unit1_relu2_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit1_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [42, 1, 0], [42, 2, 0], [44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit1_conv2", 
      "inputs": [[46, 0, 0], [46, 1, 0], [46, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit1_conv2_dequantize", 
      "inputs": [[47, 0, 0], [47, 1, 0], [47, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage1_unit1_relu3_min", 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage1_unit1_relu3_max", 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage1_unit1_relu3_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit1_conv3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [57, 1, 0], [57, 2, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit1_conv3", 
      "inputs": [[61, 0, 0], [61, 1, 0], [61, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit1_conv3_dequantize", 
      "inputs": [[62, 0, 0], [62, 1, 0], [62, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit1_sc", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[27, 0, 0], [64, 0, 0], [27, 1, 0], [27, 2, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit1_sc", 
      "inputs": [[67, 0, 0], [67, 1, 0], [67, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit1_sc_dequantize", 
      "inputs": [[68, 0, 0], [68, 1, 0], [68, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[63, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage1_unit2_relu1_min", 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage1_unit2_relu1_max", 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage1_unit2_relu1_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit2_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [79, 1, 0], [79, 2, 0], [81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit2_conv1", 
      "inputs": [[83, 0, 0], [83, 1, 0], [83, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit2_conv1_dequantize", 
      "inputs": [[84, 0, 0], [84, 1, 0], [84, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage1_unit2_relu2_min", 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage1_unit2_relu2_max", 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage1_unit2_relu2_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit2_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [94, 1, 0], [94, 2, 0], [96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit2_conv2", 
      "inputs": [[98, 0, 0], [98, 1, 0], [98, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit2_conv2_dequantize", 
      "inputs": [[99, 0, 0], [99, 1, 0], [99, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0], [102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage1_unit2_relu3_min", 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage1_unit2_relu3_max", 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage1_unit2_relu3_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit2_conv3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [109, 1, 0], [109, 2, 0], [111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit2_conv3", 
      "inputs": [[113, 0, 0], [113, 1, 0], [113, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit2_conv3_dequantize", 
      "inputs": [[114, 0, 0], [114, 1, 0], [114, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[115, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage1_unit3_relu1_min", 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage1_unit3_relu1_max", 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage1_unit3_relu1_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit3_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0], [125, 1, 0], [125, 2, 0], [127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit3_conv1", 
      "inputs": [[129, 0, 0], [129, 1, 0], [129, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit3_conv1_dequantize", 
      "inputs": [[130, 0, 0], [130, 1, 0], [130, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage1_unit3_relu2_min", 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage1_unit3_relu2_max", 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage1_unit3_relu2_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit3_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0], [140, 1, 0], [140, 2, 0], [142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit3_conv2", 
      "inputs": [[144, 0, 0], [144, 1, 0], [144, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit3_conv2_dequantize", 
      "inputs": [[145, 0, 0], [145, 1, 0], [145, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0], [148, 0, 0], [149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage1_unit3_relu3_min", 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage1_unit3_relu3_max", 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage1_unit3_relu3_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[152, 0, 0], [153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit3_conv3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[155, 0, 0], [156, 0, 0], [155, 1, 0], [155, 2, 0], [157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage1_unit3_conv3", 
      "inputs": [[159, 0, 0], [159, 1, 0], [159, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage1_unit3_conv3_dequantize", 
      "inputs": [[160, 0, 0], [160, 1, 0], [160, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[161, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0], [164, 0, 0], [165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage2_unit1_relu1_min", 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage2_unit1_relu1_max", 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage2_unit1_relu1_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[168, 0, 0], [169, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit1_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[171, 0, 0], [172, 0, 0], [171, 1, 0], [171, 2, 0], [173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage2_unit1_conv1", 
      "inputs": [[175, 0, 0], [175, 1, 0], [175, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage2_unit1_conv1_dequantize", 
      "inputs": [[176, 0, 0], [176, 1, 0], [176, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[177, 0, 0], [178, 0, 0], [179, 0, 0], [180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage2_unit1_relu2_min", 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage2_unit1_relu2_max", 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage2_unit1_relu2_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[183, 0, 0], [184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit1_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0], [186, 1, 0], [186, 2, 0], [188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage2_unit1_conv2", 
      "inputs": [[190, 0, 0], [190, 1, 0], [190, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage2_unit1_conv2_dequantize", 
      "inputs": [[191, 0, 0], [191, 1, 0], [191, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0], [194, 0, 0], [195, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage2_unit1_relu3_min", 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage2_unit1_relu3_max", 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage2_unit1_relu3_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[198, 0, 0], [199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit1_conv3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[201, 0, 0], [202, 0, 0], [201, 1, 0], [201, 2, 0], [203, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage2_unit1_conv3", 
      "inputs": [[205, 0, 0], [205, 1, 0], [205, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage2_unit1_conv3_dequantize", 
      "inputs": [[206, 0, 0], [206, 1, 0], [206, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit1_sc", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[171, 0, 0], [208, 0, 0], [171, 1, 0], [171, 2, 0], [209, 0, 0], [210, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage2_unit1_sc", 
      "inputs": [[211, 0, 0], [211, 1, 0], [211, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage2_unit1_sc_dequantize", 
      "inputs": [[212, 0, 0], [212, 1, 0], [212, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[207, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[214, 0, 0], [215, 0, 0], [216, 0, 0], [217, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage2_unit2_relu1_min", 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage2_unit2_relu1_max", 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage2_unit2_relu1_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[220, 0, 0], [221, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit2_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[223, 0, 0], [224, 0, 0], [223, 1, 0], [223, 2, 0], [225, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage2_unit2_conv1", 
      "inputs": [[227, 0, 0], [227, 1, 0], [227, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage2_unit2_conv1_dequantize", 
      "inputs": [[228, 0, 0], [228, 1, 0], [228, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[229, 0, 0], [230, 0, 0], [231, 0, 0], [232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage2_unit2_relu2_min", 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage2_unit2_relu2_max", 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage2_unit2_relu2_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[235, 0, 0], [236, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit2_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[238, 0, 0], [239, 0, 0], [238, 1, 0], [238, 2, 0], [240, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage2_unit2_conv2", 
      "inputs": [[242, 0, 0], [242, 1, 0], [242, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage2_unit2_conv2_dequantize", 
      "inputs": [[243, 0, 0], [243, 1, 0], [243, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[244, 0, 0], [245, 0, 0], [246, 0, 0], [247, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[249, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage2_unit2_relu3_min", 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage2_unit2_relu3_max", 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage2_unit2_relu3_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[250, 0, 0], [251, 0, 0], [252, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit2_conv3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[253, 0, 0], [254, 0, 0], [253, 1, 0], [253, 2, 0], [255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "_contrib_requantize", 
      "name": "requantize_stage2_unit2_conv3", 
      "inputs": [[257, 0, 0], [257, 1, 0], [257, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "stage2_unit2_conv3_dequantize", 
      "inputs": [[258, 0, 0], [258, 1, 0], [258, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[259, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[260, 0, 0], [261, 0, 0], [262, 0, 0], [263, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[265, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "stage2_unit3_relu1_min", 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "stage2_unit3_relu1_max", 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "stage2_unit3_relu1_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[266, 0, 0], [267, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit3_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
